# =============================================================================
# vlm_text_encoder  —  ONNX Runtime + TensorRT execution provider, GPU
# -----------------------------------------------------------------------------
# Encodes prompt tokens into hidden states for the LLM decoder. This file
# focuses on the `optimization.execution_accelerators` block — the cleanest
# way to get TensorRT speedups WITHOUT committing to a hand-built `.plan`.
# =============================================================================

name: "vlm_text_encoder"
platform: "onnxruntime_onnx"

max_batch_size: 64

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    # Variable seq length. ORT + TRT both support dynamic shapes, but
    # throughput is best when shapes match a TRT optimisation profile.
    dims: [ -1 ]
    # `allow_ragged_batch` stacks different-length requests into one batch
    # WITHOUT padding to the longest sequence. Backend must support it.
    # Massive wins for workloads with high length variance — wasted
    # padding flops disappear.
    allow_ragged_batch: true
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ -1 ]
    allow_ragged_batch: true
  }
]

output [
  {
    name: "text_embeds"
    # FP16 cuts memory bandwidth in half vs FP32 — usually free accuracy
    # for transformer encoders. Match this to your TRT precision below.
    data_type: TYPE_FP16
    dims: [ -1, 1024 ]
  }
]

instance_group [
  { count: 1  kind: KIND_GPU  gpus: [ 0 ] }
]

dynamic_batching {
  preferred_batch_size: [ 16, 32, 64 ]
  max_queue_delay_microseconds: 3000
}

optimization {
  # ORT graph-optimisation level:
  #   -1 default | 0 disabled | 1 basic | 2 extended | 99 all
  # Higher = more constant folding / op fusion at session-create time.
  graph { level: 1 }

  # =========================================================================
  # Execution accelerators — plug TensorRT into ORT as an execution provider.
  # ORT will offload supported subgraphs to TRT and fall back to the CUDA EP
  # for the rest. You get TRT speedups without TRT's brittleness around
  # unsupported ops, and the engine is built lazily on first run.
  # =========================================================================
  execution_accelerators {
    gpu_execution_accelerator: [
      {
        name: "tensorrt"
        # Precision modes: FP32 | FP16 | INT8
        # FP16 is the default sweet spot for transformer encoders.
        # INT8 needs a calibration cache, gives ~2× more speedup,
        # accuracy must be validated end-to-end.
        parameters { key: "precision_mode"          value: "FP16" }
        parameters { key: "max_workspace_size_bytes" value: "1073741824" }   # 1 GiB
        # Cache the built TRT engine — engine build can take 1–10 minutes
        # for large models, and rebuilding on every container start is a
        # cold-start nightmare. Cache key includes precision + input shapes.
        parameters { key: "trt_engine_cache_enable" value: "true" }
        parameters { key: "trt_engine_cache_path"   value: "/models/vlm_text_encoder/trt_cache" }
        # Helpful extras:
        # parameters { key: "trt_dla_enable"          value: "false" }
        # parameters { key: "trt_max_partition_iterations" value: "1000" }
      }
    ]
    # CPU fallback accelerator (e.g. OpenVINO for Intel CPUs). Used by
    # KIND_CPU instances. Add it for hybrid CPU/GPU deployments.
    # cpu_execution_accelerator: [{ name: "openvino" }]
  }

  input_pinned_memory  { enable: true }
  output_pinned_memory { enable: true }
}

# =============================================================================
# ORT-specific session options passed via `parameters`.
# =============================================================================
# Threading: 1 thread per session is correct for GPU work — Triton handles
# cross-request parallelism via `instance_group.count`, NOT via intra-op.
parameters: { key: "intra_op_thread_count"  value: { string_value: "1" } }
parameters: { key: "inter_op_thread_count"  value: { string_value: "1" } }

# Execution mode: 0 = SEQUENTIAL, 1 = PARALLEL. Sequential is right for
# GPU sessions; PARALLEL is for branchy CPU sessions.
parameters: { key: "execution_mode"  value: { string_value: "0" } }

# Memory pattern optimisation: pre-plans allocations based on first run.
# Disable if your shapes vary wildly run-to-run.
parameters: { key: "enable_mem_pattern"  value: { string_value: "true" } }

version_policy { latest { num_versions: 1 } }
